Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/2.4.121/samv70b/edc/ATSAMV70J20B.PIC
      <edc:AdjustPoint edc:_addr="0x400300E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400300F0" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnn--" edc:cname="MCAN0_TXEFC" edc:impl="0x3F3FFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFSA" edc:desc="Event FIFO Start Address" edc:nzwidth="0xE"/>
            <edc:SFRFieldDef edc:cname="EFS" edc:desc="Event FIFO Size" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFWM" edc:desc="Event FIFO Watermark" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300F4" edc:access="------rr---rrrrr---rrrrr--rrrrrr" edc:cname="MCAN0_TXEFS" edc:impl="0x31F1F3F" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="EFFL" edc:desc="Event FIFO Fill Level" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFGI" edc:desc="Event FIFO Get Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFPI" edc:desc="Event FIFO Put Index" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFF" edc:desc="Event FIFO Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:desc="Tx Event FIFO Element Lost" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300F8" edc:access="---------------------------nnnnn" edc:cname="MCAN0_TXEFA" edc:impl="0x1F" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="EFAI" edc:desc="Event FIFO Acknowledge Index" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400300FC" edc:offset="0x7F04"/>
      <edc:SFRDef edc:_addr="0x40038000" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVCTRL" edc:impl="0x1FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="UADD" edc:desc="USB Address" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="Address Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DETACH" edc:desc="Detach" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RMWKUP" edc:desc="Remote Wake-Up" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:desc="Mode Configuration" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW_POWER" edc:desc="For a better consumption, if high speed is not needed." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_SPEED" edc:desc="Forced high speed." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FORCED_FS" edc:desc="The peripheral remains in Full-speed mode whatever the host speed capability." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LS" edc:desc="Low-Speed Mode Force" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTJ" edc:desc="Test mode J" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTK" edc:desc="Test mode K" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTPCKT" edc:desc="Test packet mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="Specific Operational mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038004" edc:access="rrrrrrr---rrrrrrrrrr-----rrrrrrr" edc:cname="USBHS_DEVISR" edc:impl="0xFE3FF07F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Suspend Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSOF" edc:desc="Micro Start of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOF" edc:desc="Start of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORST" edc:desc="End of Reset Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="Wake-Up Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSM" edc:desc="End of Resume Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:desc="Upstream Resume Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Endpoint 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Endpoint 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Endpoint 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Endpoint 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Endpoint 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Endpoint 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Endpoint 6 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Endpoint 7 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Endpoint 8 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Endpoint 9 Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038008" edc:access="-------------------------wwwwwww" edc:cname="USBHS_DEVICR" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="SUSPC" edc:desc="Suspend Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSOFC" edc:desc="Micro Start of Frame Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFC" edc:desc="Start of Frame Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSTC" edc:desc="End of Reset Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUPC" edc:desc="Wake-Up Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSMC" edc:desc="End of Resume Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPRSMC" edc:desc="Upstream Resume Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
