Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/2.4.121/samv70b/edc/ATSAMV70J20B.PIC
      <edc:SFRDef edc:_addr="0x40048038" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_UIHVAL0" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:desc="Initial Hash Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004803C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_UIHVAL1" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:desc="Initial Hash Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048040" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_UIHVAL2" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:desc="Initial Hash Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048044" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_UIHVAL3" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:desc="Initial Hash Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048048" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_UIHVAL4" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:desc="Initial Hash Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004804C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_UIHVAL5" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:desc="Initial Hash Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048050" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_UIHVAL6" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:desc="Initial Hash Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40048054" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ICM_UIHVAL7" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:desc="Initial Hash Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40048058" edc:offset="0x3FA8"/>
      <edc:SFRDef edc:_addr="0x4004C000" edc:access="nnnnnnnnnnnnnnnn-nnnnnnnnnnnnn--" edc:cname="ISI_CFG1" edc:impl="0xFFFF7FFC" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HSYNC_POL" edc:desc="Horizontal Synchronization Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VSYNC_POL" edc:desc="Vertical Synchronization Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PIXCLK_POL" edc:desc="Pixel Clock Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GRAYLE" edc:desc="Grayscale Little Endian" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMB_SYNC" edc:desc="Embedded Synchronization" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_SYNC" edc:desc="Embedded Synchronization Correction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRATE" edc:desc="Frame Rate [0..7]" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DISCR" edc:desc="Disable Codec Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FULL" edc:desc="Full Mode is Allowed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="THMASK" edc:desc="Threshold Mask" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BEATS_4" edc:desc="Only 4 beats AHB burst allowed" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BEATS_8" edc:desc="Only 4 and 8 beats AHB burst allowed" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BEATS_16" edc:desc="4, 8 and 16 beats AHB burst allowed" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLD" edc:desc="Start of Line Delay" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SFD" edc:desc="Start of Frame Delay" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C004" edc:access="nnnn-nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ISI_CFG2" edc:impl="0xF7FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="IM_VSIZE" edc:desc="Vertical Size of the Image Sensor [0..2047]" edc:nzwidth="0xB"/>
            <edc:SFRFieldDef edc:cname="GS_MODE" edc:desc="Grayscale Pixel Format Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RGB_MODE" edc:desc="RGB Input Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GRAYSCALE" edc:desc="Grayscale Mode Format Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RGB_SWAP" edc:desc="RGB Format Swap Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COL_SPACE" edc:desc="Color Space for the Image Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IM_HSIZE" edc:desc="Horizontal Size of the Image Sensor [0..2047]" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="YCC_SWAP" edc:desc="YCrCb Format Swap Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Byte 0 Cb(i)Byte 1 Y(i)Byte 2 Cr(i)Byte 3 Y(i+1)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="Byte 0 Cr(i)Byte 1 Y(i)Byte 2 Cb(i)Byte 3 Y(i+1)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="Byte 0 Y(i)Byte 1 Cb(i)Byte 2 Y(i+1)Byte 3 Cr(i)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Byte 0 Y(i)Byte 1 Cr(i)Byte 2 Y(i+1)Byte 3 Cb(i)" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RGB_CFG" edc:desc="RGB Pixel Mapping Configuration" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Byte 0 R/G(MSB)Byte 1 G(LSB)/BByte 2 R/G(MSB)Byte 3 G(LSB)/B" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="Byte 0 B/G(MSB)Byte 1 G(LSB)/RByte 2 B/G(MSB)Byte 3 G(LSB)/R" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="Byte 0 G(LSB)/RByte 1 B/G(MSB)Byte 2 G(LSB)/RByte 3 B/G(MSB)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Byte 0 G(LSB)/BByte 1 R/G(MSB)Byte 2 G(LSB)/BByte 3 R/G(MSB)" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C008" edc:access="------nnnnnnnnnn------nnnnnnnnnn" edc:cname="ISI_PSIZE" edc:impl="0x3FF03FF" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="PREV_VSIZE" edc:desc="Vertical Size for the Preview Path" edc:nzwidth="0xA"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="PREV_HSIZE" edc:desc="Horizontal Size for the Preview Path" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C00C" edc:access="------------------------nnnnnnnn" edc:cname="ISI_PDECF" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="DEC_FACTOR" edc:desc="Decimation Factor" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
