Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/2.4.121/samv70b/edc/ATSAMV70J20B.PIC
      <edc:SFRDef edc:_addr="0x4006C05C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AES_ODATAR3" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ODATA" edc:desc="Output Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C060" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="AES_IVR0" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="IV" edc:desc="Initialization Vector" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C064" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="AES_IVR1" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="IV" edc:desc="Initialization Vector" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C068" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="AES_IVR2" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="IV" edc:desc="Initialization Vector" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C06C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="AES_IVR3" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="IV" edc:desc="Initialization Vector" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C070" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AES_AADLENR" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="AADLEN" edc:desc="Additional Authenticated Data Length" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C074" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AES_CLENR" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="CLEN" edc:desc="Plaintext/Ciphertext Length" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C078" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AES_GHASHR0" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="GHASH" edc:desc="Intermediate GCM Hash Word x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C07C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AES_GHASHR1" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="GHASH" edc:desc="Intermediate GCM Hash Word x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AES_GHASHR2" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="GHASH" edc:desc="Intermediate GCM Hash Word x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C084" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AES_GHASHR3" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="GHASH" edc:desc="Intermediate GCM Hash Word x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C088" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AES_TAGR0" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="TAG" edc:desc="GCM Authentication Tag x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C08C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AES_TAGR1" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="TAG" edc:desc="GCM Authentication Tag x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C090" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AES_TAGR2" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="TAG" edc:desc="GCM Authentication Tag x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C094" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AES_TAGR3" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="TAG" edc:desc="GCM Authentication Tag x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006C098" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AES_CTRR" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="GCM Encryption Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
