Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/2.4.121/samv70b/edc/ATSAMV70J20B.PIC
      <edc:SFRDef edc:_addr="0x400E0668" edc:access="----------rrrrrrrrrrrrrrrr--r-rr" edc:cname="PMC_SR" edc:impl="0x3FFFCB" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOCKU" edc:desc="UTMI PLL Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCSELS" edc:desc="Slow Clock Source Oscillator Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready 3 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready 4 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready 5 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready 6 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:desc="Programmable Clock Ready 7 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Clock Source Oscillator Selection Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main RC Oscillator Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDS" edc:desc="Clock Failure Detector Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FOS" edc:desc="Clock Failure Detector Fault Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:desc="Slow Crystal Oscillator Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E066C" edc:access="----------r--rrrrrrrrrrr-r--r-rr" edc:cname="PMC_IMR" edc:impl="0x27FF4B" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOCKU" edc:desc="UTMI PLL Lock Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready 3 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready 4 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready 5 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready 6 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY7" edc:desc="Programmable Clock Ready 7 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main RC Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0670" edc:access="--------nnnn-nnnnnnnnnnnnnnnnnnn" edc:cname="PMC_FSMR" edc:impl="0xF7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTT0" edc:desc="Fast Startup Input Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT1" edc:desc="Fast Startup Input Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT2" edc:desc="Fast Startup Input Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT3" edc:desc="Fast Startup Input Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT4" edc:desc="Fast Startup Input Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT5" edc:desc="Fast Startup Input Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT6" edc:desc="Fast Startup Input Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT7" edc:desc="Fast Startup Input Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT8" edc:desc="Fast Startup Input Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT9" edc:desc="Fast Startup Input Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT10" edc:desc="Fast Startup Input Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT11" edc:desc="Fast Startup Input Enable 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT12" edc:desc="Fast Startup Input Enable 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT13" edc:desc="Fast Startup Input Enable 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT14" edc:desc="Fast Startup Input Enable 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT15" edc:desc="Fast Startup Input Enable 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTAL" edc:desc="RTT Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCAL" edc:desc="RTC Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBAL" edc:desc="USB Alarm Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPM" edc:desc="Low-power Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLPM" edc:desc="Flash Low-power Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FLASH_STANDBY" edc:desc="Flash is in Standby Mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_DEEP_POWERDOWN" edc:desc="Flash is in Deep-power-down mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_IDLE" edc:desc="Idle mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FFLPM" edc:desc="Force Flash Low-power Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
